Revit 2018 API
ExternalResourceReference Members
The ExternalResourceReference type exposes the following members.
Constructors
Name | Description
ExternalResourceReference(ExternalResourceReference)
 Creates a new ExternalResourceReference from the given ExternalResourceReference.
ExternalResourceReference(Guid, IDictionary<String, String>, String, String)
 Creates a new ExternalResourceReference from the given data.
Methods
Name | Description
CreateLocalResource
 Creates an ExternalResourceReference representing a local file managed by Revit's built-in server.
Dispose
Releases all resources used by the ExternalResourceReference
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetReferenceInformation
 Returns a copy of an object containing previously-stored reference or lookup information about the specific resource provided by the server.
GetResourceShortDisplayName
 Gets the short display name of the external resource.
GetResourceVersionStatus
 Checks whether this ExternalResourceReference corresponds to the current version of the resource.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasValidDisplayPath
 Checks whether this external Resource has a valid display path.
IsValidReference
 Checks whether the reference is in a valid format.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
InSessionPath
The path stores the full display path which includes the server name plus the path provided by ExternalResourceServer.
The path that Revit will present for user recognizing and browsing to this resource during one session of Revit.
This property allows ExternalResourceServers to handle cases where the path to a resource may vary between Revit sessions. For example, if this ExternalResourceReference refers to a resource in a folder, this property can be used to store the current path of the resource. If the resource is moved to another folder later, the ExternalResourceServer could calculate the correct path for the resource from resource identification information when it is loaded and store it in this property, so that it will work correctly even if the rvt file is opened in a different location.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ServerId
 The id of the server that Revit is expecting to provide the external resource.
Version
 The version of the external data that was most recently loaded in Revit.
See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace